#!/usr/bin/python
#-*-coding: utf-8 -*
from __future__ import unicode_literals

from django.db import models
from django.contrib.sessions.models import Session

class Person(models.Model):
    session=models.ForeignKey(Session,blank=True,null=True)
    name=models.CharField(max_length=100)
    dob=models.DateField(blank=False,null=False)
    age=models.CharField(max_length=2)
    gender=models.CharField(
        choices=(
            ('Male', 'Male'),
            ('Female', 'Female'),
            ),
        max_length=6,
        )
    job=models.CharField(
        choices=(
            (u'นักเรียน/นักศึกษา', u'นักเรียน/นักศึกษา'),
            (u'ครู/อาจารย์', u'ครู/อาจารย์'),
            (u'แพทย์/พยาบาล', u'แพทย์/พยาบาล'),
            (u'ทหาร/ตำรวจ', u'ทหาร/ตำรวจ'),
            (u'รับจ้าง', u'รับจ้าง'),
            (u'พนักงานบริษัท', u'พนักงานบริษัท'),
            (u'ข้าราชการ', u'ข้าราชการ'),
            (u'เกษตรกร', u'เกษตรกร'),
            (u'นักกฎหมาย', u'นักกฎหมาย'),
            (u'นักการเมือง', u'นักการเมือง'),
            (u'นักวิทยาศาสตร์', u'นักวิทยาศาสตร์'),
            (u'ศิลปิน', u'ศิลปิน'),
            (u'เชฟ', u'เชฟ'),
            (u'อื่น ๆ', u'อื่น ๆ'),
            ),
        max_length=100,
        )
    province=models.CharField(
        choices=(
            (u'กรุงเทพมหานคร', u'กรุงเทพมหานคร'),
            (u'กระบี่', u'กระบี่'),
            (u'กาญจนบุรี', u'กาญจนบุรี'),
            (u'กาฬสินธุ์', u'กาฬสินธุ์'),
            (u'กำแพงเพชร', u'กำแพงเพชร'),
            (u'ขอนแก่น', u'ขอนแก่น'),
            (u'จันทบุรี', u'จันทบุรี'),
            (u'ฉะเชิงเทรา', u'ฉะเชิงเทรา'),
            (u'ชลบุรี', u'ชลบุรี'),
            (u'ชัยนาท', u'ชัยนาท'),
            (u'ชัยภูมิ', u'ชัยภูมิ'),
            (u'ชุมพร', u'ชุมพร'),
            (u'เชียงราย', u'เชียงราย'),
            (u'เชียงใหม่', u'เชียงใหม่'),
            (u'ตรัง', u'ตรัง'),
            (u'ตราด', u'ตราด'),
            (u'ตาก', u'ตาก'),
            (u'นครนายก', u'นครนายก'),
            (u'นครปฐม', u'นครปฐม'),
            (u'นครพนม', u'นครพนม'),
            (u'นครราชสีมา', u'นครราชสีมา'),
            (u'นครศรีธรรมราช', u'นครศรีธรรมราช'),
            (u'นครสวรรค์', u'นครสวรรค์'),
            (u'นนทบุรี', u'นนทบุรี'),
            (u'นราธิวาส', u'นราธิวาส'),
            (u'น่าน', u'น่าน'),
            (u'บึงกาฬ', u'บึงกาฬ'),
            (u'บุรีรัมย์', u'บุรีรัมย์'),
            (u'ปทุมธานี', u'ปทุมธานี'),
            (u'ประจวบคีรีขันธ์', u'ประจวบคีรีขันธ์'),
            (u'ปราจีนบุรี', u'ปราจีนบุรี'),
            (u'ปัตตานี', u'ปัตตานี'),
            (u'พระนครศรีอยุธยา', u'พระนครศรีอยุธยา'),
            (u'พังงา', u'พังงา'),
            (u'พัทลุง', u'พัทลุง'),
            (u'พิจิตร', u'พิจิตร'),
            (u'พิษณุโลก', u'พิษณุโลก'),
            (u'เพชรบุรี', u'เพชรบุรี'),
            (u'เพชรบูรณ์', u'เพชรบูรณ์'),
            (u'แพร่', u'แพร่'),
            (u'พะเยา', u'พะเยา'),
            (u'ภูเก็ต', u'ภูเก็ต'),
            (u'มหาสารคาม', u'มหาสารคาม'),
            (u'มุกดาหาร', u'มุกดาหาร'),
            (u'แม่ฮ่องสอน', u'แม่ฮ่องสอน'),
            (u'ยะลา', u'ยะลา'),
            (u'ยโสธร', u'ยโสธร'),
            (u'ร้อยเอ็ด', u'ร้อยเอ็ด'),
            (u'ระนอง', u'ระนอง'),
            (u'ระยอง', u'ระยอง'),
            (u'ราชบุรี', u'ราชบุรี'),
            (u'ลพบุรี', u'ลพบุรี'),
            (u'ลำปาง', u'ลำปาง'),
            (u'ลำพูน', u'ลำพูน'),
            (u'เลย', u'เลย'),
            (u'ศรีสะเกษ', u'ศรีสะเกษ'),
            (u'สกลนคร', u'สกลนคร'),
            (u'สงขลา', u'สงขลา'),
            (u'สตูล', u'สตูล'),
            (u'สมุทรปราการ', u'สมุทรปราการ'),
            (u'สมุทรสงคราม', u'สมุทรสงคราม'),
            (u'สมุทรสาคร', u'สมุทรสาคร'),
            (u'สระแก้ว', u'สระแก้ว'),
            (u'สระบุรี', u'สระบุรี'),
            (u'สิงห์บุรี', u'สิงห์บุรี'),
            (u'สุโขทัย', u'สุโขทัย'),
            (u'สุพรรณบุรี', u'สุพรรณบุรี'),
            (u'สุราษฎร์ธานี', u'สุราษฎร์ธานี'),
            (u'สุรินทร์', u'สุรินทร์'),
            (u'หนองคาย', u'หนองคาย'),
            (u'หนองบัวลำภู', u'หนองบัวลำภู'),
            (u'อ่างทอง', u'อ่างทอง'),
            (u'อุดรธานี', u'อุดรธานี'),
            (u'อุทัยธานี', u'อุทัยธานี'),
            (u'อุตรดิตถ์', u'อุตรดิตถ์'),
            (u'อุบลราชธานี', u'อุบลราชธานี'),
            (u'อำนาจเจริญ', u'อำนาจเจริญ'),
            ),
        max_length=20,
        )
    typeofphone=models.CharField(
        choices=(
            ('OSI','IOS'),
            ('Android', 'Android'),
            ),
        max_length=7,
        )
    def __unicode__(self):
        return u"%s"%(self.name)

class Image(models.Model):
    image=models.ImageField(upload_to='images')
    description=models.CharField(max_length=100,blank=True,null=True)